# 1. Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться
# звездочками

# def card(num):
#     return '*' * (len(num)-4) + num[-4:]
#
#
# print(card('012345678912'))


# 2. Напишите функцию, которая проверяет: является ли слово палиндромом

# def word(a):
#     return a[::-1]
#
#
# def palindrome(a):
#     a_p = word(a)
#
#     if a == a_p:
#         return True
#     return False
#
#
# a = 'шалаш'
# print(palindrome(a))

